[View in Colaboratory](https://colab.research.google.com/github/sungreong/TIL/blob/master/Pandas_Data_Cleaning_and_Preparation.ipynb)

## Refer

http://nbviewer.jupyter.org/github/pydata/pydata-book/blob/2nd-edition/ch07.ipynb

In [0]:
import numpy as np
import pandas as pd
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

## Handling Missing Data

In [4]:
string_data = pd.Series( [ "a","b","c","d", np.nan])
string_data
string_data.isnull()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [6]:
string_data[string_data.isnull()]

4    NaN
dtype: object

In [7]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2    False
3    False
4     True
dtype: bool

## Filtering Out Missing Data

In [8]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
clean = data.dropna(how="any")
clean = data.dropna()
clean

     0    1    2
0  1.0  6.5  3.0

In [18]:
## default axis = 0 
data.dropna(axis=0 ,  how="all")
data.dropna( how="all")

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [17]:
data[4] = NA
data.dropna( axis = 1 , how = "all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [26]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4 , 1 ] = NA
df.iloc[:1, 2] = NA
print(df)
print(df.dropna())
df.dropna(thresh=2)

          0         1         2
0 -0.017141       NaN       NaN
1 -0.757177       NaN -0.304273
2 -1.677790       NaN -1.563740
3 -0.367488       NaN  1.219954
4 -0.247699 -0.416232 -0.116747
5 -1.844788  2.068708 -0.776967
6  1.440167 -0.110557  1.227387
          0         1         2
4 -0.247699 -0.416232 -0.116747
5 -1.844788  2.068708 -0.776967
6  1.440167 -0.110557  1.227387

          0         1         2
1 -0.757177       NaN -0.304273
2 -1.677790       NaN -1.563740
3 -0.367488       NaN  1.219954
4 -0.247699 -0.416232 -0.116747
5 -1.844788  2.068708 -0.776967
6  1.440167 -0.110557  1.227387

## Filling In Missing Data

In [43]:
df.fillna(0)
## 특정 열마다 다르게 채우기
print(df)
df.fillna({ 1: 0.5 , 2: 100})
df.fillna({ 1: df.loc[1].mean() , 2: df.loc[2].max()})
## 모든 평균
df.fillna( data.mean( ))

          0         1         2
0  1.920784  0.746433  2.224660
1 -0.679400  0.727369 -0.868731
2 -1.213851       NaN -0.919242
3 -0.838827       NaN -0.557805
4 -0.567455       NaN       NaN
5  1.755108       NaN       NaN

          0         1         2
0  1.920784  0.746433  2.224660
1 -0.679400  0.727369 -0.868731
2 -1.213851  3.833333 -0.919242
3 -0.838827  3.833333 -0.557805
4 -0.567455  3.833333  3.833333
5  1.755108  3.833333  3.833333

In [34]:
_ = df.fillna( 0 , inplace=  True )
df

          0         1         2
0 -0.017141  0.000000  0.000000
1 -0.757177  0.000000 -0.304273
2 -1.677790  0.000000 -1.563740
3 -0.367488  0.000000  1.219954
4 -0.247699 -0.416232 -0.116747
5 -1.844788  2.068708 -0.776967
6  1.440167 -0.110557  1.227387

In [35]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  1.920784  0.746433  2.224660
1 -0.679400  0.727369 -0.868731
2 -1.213851       NaN -0.919242
3 -0.838827       NaN -0.557805
4 -0.567455       NaN       NaN
5  1.755108       NaN       NaN

In [36]:
df.fillna(method='ffill')

          0         1         2
0  1.920784  0.746433  2.224660
1 -0.679400  0.727369 -0.868731
2 -1.213851  0.727369 -0.919242
3 -0.838827  0.727369 -0.557805
4 -0.567455  0.727369 -0.557805
5  1.755108  0.727369 -0.557805

In [37]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  1.920784  0.746433  2.224660
1 -0.679400  0.727369 -0.868731
2 -1.213851  0.727369 -0.919242
3 -0.838827  0.727369 -0.557805
4 -0.567455       NaN -0.557805
5  1.755108       NaN -0.557805

In [38]:
data = pd.Series( [ 1. , NA , 3.5 , NA , 7 ])
data.fillna( data.mean() )

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Data Transformation

In [45]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [46]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [47]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [52]:
data["v1" ] = range(7)
## 열별로 유니크하게 
data.drop_duplicates(["k1","k2"])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

In [53]:
## index  살려서 뽑기  
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

## Transforming Data Using a Function or Mapping¶

In [0]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data


meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [59]:
## 소문자화 시키기
lowercased = data["food"].str.lower()
data["animal"] = lowercased.map( meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [60]:
data["food"].map( lambda x : meat_to_animal[ x.lower() ])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## Renaming Axis Indexes

In [62]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

transform = lambda x: x[:4].upper()
data.index.map(transform)
data.columns.map(transform)

Index(['ONE', 'TWO', 'THRE', 'FOUR'], dtype='object')

In [71]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [72]:
## 소문자 대문자 구별되므로 잘 넣어야 한다.
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

          one  two  peekaboo  four
Ohio        0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11

In [74]:
data.rename(index={'Ohio': 'INDIANA'}, inplace=True)
data

          one  two  three  four
INDIANA     0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

## Discretization and Binning

In [75]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [80]:
print(cats.codes)
print(cats.categories)
pd.value_counts(cats)
cats.value_counts()

[0 0 0 1 0 0 2 1 3 2 2 1]
IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [81]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [87]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
cut2 = pd.cut(ages, bins, labels=group_names)
print( cut2.value_counts() )
cut2.categories

Youth         5
YoungAdult    3
MiddleAged    3
Senior        1
dtype: int64

Index(['Youth', 'YoungAdult', 'MiddleAged', 'Senior'], dtype='object')

In [90]:
data = np.random.rand(20)
## precision 소숫점 기준을 몇자리 까지 할껀지 
pd.cut(data, 4, precision=2)

[(0.72, 0.96], (2.7e-06, 0.24], (2.7e-06, 0.24], (0.48, 0.72], (0.24, 0.48], ..., (2.7e-06, 0.24], (0.24, 0.48], (0.24, 0.48], (2.7e-06, 0.24], (0.48, 0.72]]
Length: 20
Categories (4, interval[float64]): [(2.7e-06, 0.24] < (0.24, 0.48] < (0.48, 0.72] < (0.72, 0.96]]

In [92]:
## quantile cut
data = np.random.randn(1000)  # Normally distributed

group_names = ["1Q","2Q","3Q","4Q"]
cats = pd.qcut(data, 4 , labels = group_names )  # Cut into quartiles
cats
pd.value_counts(cats)

4Q    250
3Q    250
2Q    250
1Q    250
dtype: int64

In [94]:
## 뽑히는 구간을 임의로 정할 수 있다 
group_names = ["0~0.1","0.1~0.5","0.5~0.9","0.9~1.0"]
cats = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.] , labels = group_names)
cats.value_counts()

0~0.1      100
0.1~0.5    400
0.5~0.9    400
0.9~1.0    100
dtype: int64

## Detecting and Filtering Outliers

In [95]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.030725     0.003542     0.039511    -0.044767
std       0.990920     1.026097     0.989885     0.979792
min      -3.108915    -3.645860    -3.333767    -2.901831
25%      -0.743085    -0.692099    -0.634767    -0.747851
50%      -0.080064     0.027756     0.022671    -0.071723
75%       0.634823     0.722198     0.685944     0.666408
max       3.366626     2.763474     3.525865     2.611678

In [98]:
col = data[2]
col[ np.abs(col) >  3 ]

28    -3.184377
488    3.525865
731   -3.333767
Name: 2, dtype: float64

In [102]:
# data 열별로 한개라도 3이 넘는게 있으면 뽑히기 그 행은 다 뽑기 
data[ ( np.abs(data) > 3.5).any(1) ]

            0         1         2         3
250 -0.362528 -3.548824  1.553205 -2.186301
488 -0.658090 -0.207434  3.525865  0.283070
509  0.599947 -3.645860  0.255475 -0.549574

In [103]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.030983     0.004940     0.039504    -0.044767
std       0.989396     1.021625     0.986499     0.979792
min      -3.000000    -3.000000    -3.000000    -2.901831
25%      -0.743085    -0.692099    -0.634767    -0.747851
50%      -0.080064     0.027756     0.022671    -0.071723
75%       0.634823     0.722198     0.685944     0.666408
max       3.000000     2.763474     3.000000     2.611678

In [105]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0 -1.0  1.0
1  1.0  1.0 -1.0 -1.0
2 -1.0  1.0  1.0 -1.0
3 -1.0 -1.0 -1.0  1.0
4  1.0  1.0  1.0 -1.0

## Permutation and Random Sampling

In [112]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
print(df)
sampler = np.random.permutation(4)
sampler

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

array([2, 1, 3, 0])

In [113]:
## 랜덤으로 행 뽑기 
df.take(sampler)

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3

In [114]:
## 랜덤으로 뽑기 
df.sample(n=4)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3
2   8   9  10  11

In [115]:
## 랜덤으로 뽑기 
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

1    7
3    6
2   -1
1    7
1    7
0    5
4    4
3    6
1    7
0    5
dtype: int64

## Computing Indicator/Dummy Variables

In [116]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})

pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [121]:
dummies = pd.get_dummies( df["key"],prefix ="key" , prefix_sep="__")
dummies

   key__a  key__b  key__c
0       0       1       0
1       0       1       0
2       1       0       0
3       0       0       1
4       1       0       0
5       0       1       0

In [123]:

df_with_dummy  = df[["data1"]].join(dummies)
df_with_dummy

   data1
0      0
1      1
2      2
3      3
4      4
5      5

   data1  key__a  key__b  key__c
0      0       0       1       0
1      1       0       1       0
2      2       1       0       0
3      3       0       0       1
4      4       1       0       0
5      5       0       1       0

# String Manipulation

## String Object Methods

In [124]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [125]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [128]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [129]:
'::'.join(pieces)

'a::b::guido'

In [141]:
print(val)
'guido' in val
val.index(',')
val.find(":")
val.find(",")
val.count(',')

a,b,  guido

1

In [145]:
val.replace(',', '::')
val.replace(',', '')

'ab  guido'

## Regular Expressions

In [147]:
import re
text = "foo    bar\t baz  \tqux"
print(text)
re.split('\s+', text)

foo    bar	 baz  	qux

['foo', 'bar', 'baz', 'qux']

In [148]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [149]:
regex.findall(text)

['    ', '\t ', '  \t']

In [0]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'


# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [159]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [161]:
m = regex.search(text)
print(m, "\n")
text[m.start():m.end()]

<_sre.SRE_Match object; span=(5, 20), match='dave@google.com'>

'dave@google.com'

In [162]:
print(regex.match(text))

None

In [163]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [164]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [165]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [166]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

## Vectorized String Functions in pandas

In [167]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data
data.isnull()

Dave     False
Rob      False
Steve    False
Wes       True
dtype: bool

In [169]:
data.str.contains('gmail')

Dave     False
Rob       True
Steve     True
Wes        NaN
dtype: object

In [171]:
print( pattern )
data.str.findall(pattern, flags=re.IGNORECASE)

([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})

Dave     [(dave, google, com)]
Rob        [(rob, gmail, com)]
Steve    [(steve, gmail, com)]
Wes                        NaN
dtype: object

In [172]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Rob      True
Steve    True
Wes       NaN
dtype: object

In [175]:
matches.str.get(1)
matches.str[0]

Dave    NaN
Rob     NaN
Steve   NaN
Wes     NaN
dtype: float64

In [176]:
data.str[:5]

Dave     dave@
Rob      rob@g
Steve    steve
Wes        NaN
dtype: object